{
  "transform_params" : {
    "image" : {
      "bias_a" : 0,
      "bias_g" : -1,
      "bias_r" : -1,
      "bias_b" : -1,
      "center_mean" : 0,
      "is_network_bgr" : 1,
      "scale" : 0.0078431377187371254
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "stem_conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stem_conv1_output",
      "K" : 3,
      "blob_biases" : 1,
      "name" : "stem_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 76,
      "bottom" : "image",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "bottom" : "stem_conv1_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "stem_block1_conv1_act",
      "top" : "stem_block1_conv1_act_output",
      "type" : "activation",
      "name" : "stem_block1_conv1_act"
    },
    {
      "name" : "stem_block1_conv1_bn",
      "bottom" : "stem_block1_conv1_act_output",
      "weights" : {

      },
      "debug_info" : "stem_block1_conv1_bn",
      "top" : "stem_block1_conv1_bn_output",
      "C" : 76,
      "blob_batchnorm_params" : 5,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "stem_block1_conv1_exp",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stem_block1_conv1_exp_act_output",
      "K" : 76,
      "blob_biases" : 7,
      "name" : "stem_block1_conv1_exp",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "stem_block1_conv1_bn_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 9
    },
    {
      "name" : "stem_block1_conv1_exp_bn",
      "bottom" : "stem_block1_conv1_exp_act_output",
      "weights" : {

      },
      "debug_info" : "stem_block1_conv1_exp_bn",
      "top" : "stem_block1_conv1_exp_bn_output",
      "C" : 152,
      "blob_batchnorm_params" : 11,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "stem_block1_conv1_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stem_block1_conv1_output_intermin_",
      "K" : 152,
      "name" : "stem_block1_conv1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 152,
      "bottom" : "stem_block1_conv1_exp_bn_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 13
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "stem_block1_conv1_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stem_block1_conv2_act_output",
      "K" : 152,
      "blob_biases" : 15,
      "name" : "stem_block1_conv1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 76,
      "bottom" : "stem_block1_conv1_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 17
    },
    {
      "name" : "stem_block1_conv2_bn",
      "bottom" : "stem_block1_conv2_act_output",
      "weights" : {

      },
      "debug_info" : "stem_block1_conv2_bn",
      "top" : "stem_block1_conv2_bn_output",
      "C" : 76,
      "blob_batchnorm_params" : 19,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "stem_block1_conv2_exp",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stem_block1_conv2_exp_act_output",
      "K" : 76,
      "blob_biases" : 21,
      "name" : "stem_block1_conv2_exp",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "stem_block1_conv2_bn_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 23
    },
    {
      "name" : "stem_block1_conv2_exp_bn",
      "bottom" : "stem_block1_conv2_exp_act_output",
      "weights" : {

      },
      "debug_info" : "stem_block1_conv2_exp_bn",
      "top" : "stem_block1_conv2_exp_bn_output",
      "C" : 152,
      "blob_batchnorm_params" : 25,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "stem_block1_conv2_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stem_block1_conv2_output_intermin_",
      "K" : 152,
      "name" : "stem_block1_conv2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 152,
      "bottom" : "stem_block1_conv2_exp_bn_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 27
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "stem_block1_conv2_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stem_block1_conv2_output",
      "K" : 152,
      "blob_biases" : 29,
      "name" : "stem_block1_conv2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 76,
      "bottom" : "stem_block1_conv2_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "bottom" : "stem_conv1_output,stem_block1_conv2_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "stem_block1_residual",
      "top" : "stem_block1_residual_output",
      "type" : "elementwise",
      "name" : "stem_block1_residual",
      "beta" : 0
    },
    {
      "bottom" : "stem_block1_residual_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "stem_block2_conv1_act",
      "top" : "stem_block2_conv1_act_output",
      "type" : "activation",
      "name" : "stem_block2_conv1_act"
    },
    {
      "name" : "stem_block2_conv1_bn",
      "bottom" : "stem_block2_conv1_act_output",
      "weights" : {

      },
      "debug_info" : "stem_block2_conv1_bn",
      "top" : "stem_block2_conv1_bn_output",
      "C" : 76,
      "blob_batchnorm_params" : 33,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "stem_block2_conv1_exp",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stem_block2_conv1_exp_act_output",
      "K" : 76,
      "blob_biases" : 35,
      "name" : "stem_block2_conv1_exp",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "stem_block2_conv1_bn_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 37
    },
    {
      "name" : "stem_block2_conv1_exp_bn",
      "bottom" : "stem_block2_conv1_exp_act_output",
      "weights" : {

      },
      "debug_info" : "stem_block2_conv1_exp_bn",
      "top" : "stem_block2_conv1_exp_bn_output",
      "C" : 152,
      "blob_batchnorm_params" : 39,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "stem_block2_conv1_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stem_block2_conv1_output_intermin_",
      "K" : 152,
      "name" : "stem_block2_conv1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 152,
      "bottom" : "stem_block2_conv1_exp_bn_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 41
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "stem_block2_conv1_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stem_block2_conv2_act_output",
      "K" : 152,
      "blob_biases" : 43,
      "name" : "stem_block2_conv1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 76,
      "bottom" : "stem_block2_conv1_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 45
    },
    {
      "name" : "stem_block2_conv2_bn",
      "bottom" : "stem_block2_conv2_act_output",
      "weights" : {

      },
      "debug_info" : "stem_block2_conv2_bn",
      "top" : "stem_block2_conv2_bn_output",
      "C" : 76,
      "blob_batchnorm_params" : 47,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "stem_block2_conv2_exp",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stem_block2_conv2_exp_act_output",
      "K" : 76,
      "blob_biases" : 49,
      "name" : "stem_block2_conv2_exp",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "stem_block2_conv2_bn_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 51
    },
    {
      "name" : "stem_block2_conv2_exp_bn",
      "bottom" : "stem_block2_conv2_exp_act_output",
      "weights" : {

      },
      "debug_info" : "stem_block2_conv2_exp_bn",
      "top" : "stem_block2_conv2_exp_bn_output",
      "C" : 152,
      "blob_batchnorm_params" : 53,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "stem_block2_conv2_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stem_block2_conv2_output_intermin_",
      "K" : 152,
      "name" : "stem_block2_conv2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 152,
      "bottom" : "stem_block2_conv2_exp_bn_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 55
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "stem_block2_conv2_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stem_block2_conv2_output",
      "K" : 152,
      "blob_biases" : 57,
      "name" : "stem_block2_conv2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 76,
      "bottom" : "stem_block2_conv2_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 59
    },
    {
      "bottom" : "stem_block1_residual_output,stem_block2_conv2_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "stem_block2_residual",
      "top" : "stem_block2_residual_output",
      "type" : "elementwise",
      "name" : "stem_block2_residual",
      "beta" : 0
    },
    {
      "bottom" : "stem_block2_residual_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "unet0_l1_conv1_act",
      "top" : "unet0_l1_conv1_act_output",
      "type" : "activation",
      "name" : "unet0_l1_conv1_act"
    },
    {
      "name" : "unet0_l1_conv1_bn",
      "bottom" : "unet0_l1_conv1_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l1_conv1_bn",
      "top" : "unet0_l1_conv1_bn_output",
      "C" : 76,
      "blob_batchnorm_params" : 61,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l1_conv1_exp",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l1_conv1_exp_act_output",
      "K" : 76,
      "blob_biases" : 63,
      "name" : "unet0_l1_conv1_exp",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "unet0_l1_conv1_bn_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 65
    },
    {
      "name" : "unet0_l1_conv1_exp_bn",
      "bottom" : "unet0_l1_conv1_exp_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l1_conv1_exp_bn",
      "top" : "unet0_l1_conv1_exp_bn_output",
      "C" : 152,
      "blob_batchnorm_params" : 67,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l1_conv1_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l1_conv1_output_intermin_",
      "K" : 152,
      "name" : "unet0_l1_conv1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 152,
      "bottom" : "unet0_l1_conv1_exp_bn_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 69
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l1_conv1_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l1_conv2_act_output",
      "K" : 152,
      "blob_biases" : 71,
      "name" : "unet0_l1_conv1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 76,
      "bottom" : "unet0_l1_conv1_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 73
    },
    {
      "name" : "unet0_l1_conv2_bn",
      "bottom" : "unet0_l1_conv2_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l1_conv2_bn",
      "top" : "unet0_l1_conv2_bn_output",
      "C" : 76,
      "blob_batchnorm_params" : 75,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l1_conv2_exp",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l1_conv2_exp_act_output",
      "K" : 76,
      "blob_biases" : 77,
      "name" : "unet0_l1_conv2_exp",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "unet0_l1_conv2_bn_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 79
    },
    {
      "name" : "unet0_l1_conv2_exp_bn",
      "bottom" : "unet0_l1_conv2_exp_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l1_conv2_exp_bn",
      "top" : "unet0_l1_conv2_exp_bn_output",
      "C" : 152,
      "blob_batchnorm_params" : 81,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l1_conv2_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l1_conv2_output_intermin_",
      "K" : 152,
      "name" : "unet0_l1_conv2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 152,
      "bottom" : "unet0_l1_conv2_exp_bn_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 83
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l1_conv2_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l1_conv2_output",
      "K" : 152,
      "blob_biases" : 85,
      "name" : "unet0_l1_conv2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 76,
      "bottom" : "unet0_l1_conv2_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 87
    },
    {
      "bottom" : "stem_block2_residual_output,unet0_l1_conv2_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "unet0_l1_residual",
      "top" : "unet0_l1_residual_output",
      "type" : "elementwise",
      "name" : "unet0_l1_residual",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "unet0_l1_down",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "unet0_l1_down_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "unet0_l1_down",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "unet0_l1_residual_output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "bottom" : "unet0_l1_down_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "unet0_l2_conv1_act",
      "top" : "unet0_l2_conv1_act_output",
      "type" : "activation",
      "name" : "unet0_l2_conv1_act"
    },
    {
      "name" : "unet0_l2_conv1_bn",
      "bottom" : "unet0_l2_conv1_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l2_conv1_bn",
      "top" : "unet0_l2_conv1_bn_output",
      "C" : 76,
      "blob_batchnorm_params" : 89,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l2_conv1_exp",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l2_conv1_exp_act_output",
      "K" : 76,
      "blob_biases" : 91,
      "name" : "unet0_l2_conv1_exp",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "unet0_l2_conv1_bn_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 93
    },
    {
      "name" : "unet0_l2_conv1_exp_bn",
      "bottom" : "unet0_l2_conv1_exp_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l2_conv1_exp_bn",
      "top" : "unet0_l2_conv1_exp_bn_output",
      "C" : 152,
      "blob_batchnorm_params" : 95,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l2_conv1_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l2_conv1_output_intermin_",
      "K" : 152,
      "name" : "unet0_l2_conv1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 152,
      "bottom" : "unet0_l2_conv1_exp_bn_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 97
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l2_conv1_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l2_conv2_act_output",
      "K" : 152,
      "blob_biases" : 99,
      "name" : "unet0_l2_conv1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 76,
      "bottom" : "unet0_l2_conv1_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 101
    },
    {
      "name" : "unet0_l2_conv2_bn",
      "bottom" : "unet0_l2_conv2_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l2_conv2_bn",
      "top" : "unet0_l2_conv2_bn_output",
      "C" : 76,
      "blob_batchnorm_params" : 103,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l2_conv2_exp",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l2_conv2_exp_act_output",
      "K" : 76,
      "blob_biases" : 105,
      "name" : "unet0_l2_conv2_exp",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "unet0_l2_conv2_bn_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 107
    },
    {
      "name" : "unet0_l2_conv2_exp_bn",
      "bottom" : "unet0_l2_conv2_exp_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l2_conv2_exp_bn",
      "top" : "unet0_l2_conv2_exp_bn_output",
      "C" : 152,
      "blob_batchnorm_params" : 109,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l2_conv2_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l2_conv2_output_intermin_",
      "K" : 152,
      "name" : "unet0_l2_conv2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 152,
      "bottom" : "unet0_l2_conv2_exp_bn_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 111
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l2_conv2_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l2_conv2_output",
      "K" : 152,
      "blob_biases" : 113,
      "name" : "unet0_l2_conv2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 76,
      "bottom" : "unet0_l2_conv2_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 115
    },
    {
      "bottom" : "unet0_l1_down_output,unet0_l2_conv2_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "unet0_l2_residual",
      "top" : "unet0_l2_residual_output",
      "type" : "elementwise",
      "name" : "unet0_l2_residual",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "unet0_l2_down",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "unet0_l2_down_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "unet0_l2_down",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "unet0_l2_residual_output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "bottom" : "unet0_l2_down_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "unet0_l3_conv1_act",
      "top" : "unet0_l3_conv1_act_output",
      "type" : "activation",
      "name" : "unet0_l3_conv1_act"
    },
    {
      "name" : "unet0_l3_conv1_bn",
      "bottom" : "unet0_l3_conv1_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l3_conv1_bn",
      "top" : "unet0_l3_conv1_bn_output",
      "C" : 76,
      "blob_batchnorm_params" : 117,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l3_conv1_exp",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l3_conv1_exp_act_output",
      "K" : 76,
      "blob_biases" : 119,
      "name" : "unet0_l3_conv1_exp",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "unet0_l3_conv1_bn_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 121
    },
    {
      "name" : "unet0_l3_conv1_exp_bn",
      "bottom" : "unet0_l3_conv1_exp_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l3_conv1_exp_bn",
      "top" : "unet0_l3_conv1_exp_bn_output",
      "C" : 152,
      "blob_batchnorm_params" : 123,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l3_conv1_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l3_conv1_output_intermin_",
      "K" : 152,
      "name" : "unet0_l3_conv1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 152,
      "bottom" : "unet0_l3_conv1_exp_bn_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 125
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l3_conv1_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l3_conv2_act_output",
      "K" : 152,
      "blob_biases" : 127,
      "name" : "unet0_l3_conv1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 76,
      "bottom" : "unet0_l3_conv1_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 129
    },
    {
      "name" : "unet0_l3_conv2_bn",
      "bottom" : "unet0_l3_conv2_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l3_conv2_bn",
      "top" : "unet0_l3_conv2_bn_output",
      "C" : 76,
      "blob_batchnorm_params" : 131,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l3_conv2_exp",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l3_conv2_exp_act_output",
      "K" : 76,
      "blob_biases" : 133,
      "name" : "unet0_l3_conv2_exp",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "unet0_l3_conv2_bn_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 135
    },
    {
      "name" : "unet0_l3_conv2_exp_bn",
      "bottom" : "unet0_l3_conv2_exp_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l3_conv2_exp_bn",
      "top" : "unet0_l3_conv2_exp_bn_output",
      "C" : 152,
      "blob_batchnorm_params" : 137,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l3_conv2_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l3_conv2_output_intermin_",
      "K" : 152,
      "name" : "unet0_l3_conv2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 152,
      "bottom" : "unet0_l3_conv2_exp_bn_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 139
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l3_conv2_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l3_conv2_output",
      "K" : 152,
      "blob_biases" : 141,
      "name" : "unet0_l3_conv2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 76,
      "bottom" : "unet0_l3_conv2_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 143
    },
    {
      "bottom" : "unet0_l2_down_output,unet0_l3_conv2_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "unet0_l3_residual",
      "top" : "unet0_l3_residual_output",
      "type" : "elementwise",
      "name" : "unet0_l3_residual",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "unet0_l3_down",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "unet0_l3_down_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "unet0_l3_down",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "unet0_l3_residual_output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "bottom" : "unet0_l3_down_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "unet0_l4_conv1_act",
      "top" : "unet0_l4_conv1_act_output",
      "type" : "activation",
      "name" : "unet0_l4_conv1_act"
    },
    {
      "name" : "unet0_l4_conv1_bn",
      "bottom" : "unet0_l4_conv1_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l4_conv1_bn",
      "top" : "unet0_l4_conv1_bn_output",
      "C" : 76,
      "blob_batchnorm_params" : 145,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l4_conv1_exp",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l4_conv1_exp_act_output",
      "K" : 76,
      "blob_biases" : 147,
      "name" : "unet0_l4_conv1_exp",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "unet0_l4_conv1_bn_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 149
    },
    {
      "name" : "unet0_l4_conv1_exp_bn",
      "bottom" : "unet0_l4_conv1_exp_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l4_conv1_exp_bn",
      "top" : "unet0_l4_conv1_exp_bn_output",
      "C" : 152,
      "blob_batchnorm_params" : 151,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l4_conv1_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l4_conv1_output_intermin_",
      "K" : 152,
      "name" : "unet0_l4_conv1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 152,
      "bottom" : "unet0_l4_conv1_exp_bn_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 153
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l4_conv1_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l4_conv2_act_output",
      "K" : 152,
      "blob_biases" : 155,
      "name" : "unet0_l4_conv1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 76,
      "bottom" : "unet0_l4_conv1_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 157
    },
    {
      "name" : "unet0_l4_conv2_bn",
      "bottom" : "unet0_l4_conv2_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l4_conv2_bn",
      "top" : "unet0_l4_conv2_bn_output",
      "C" : 76,
      "blob_batchnorm_params" : 159,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l4_conv2_exp",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l4_conv2_exp_act_output",
      "K" : 76,
      "blob_biases" : 161,
      "name" : "unet0_l4_conv2_exp",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "unet0_l4_conv2_bn_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 163
    },
    {
      "name" : "unet0_l4_conv2_exp_bn",
      "bottom" : "unet0_l4_conv2_exp_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l4_conv2_exp_bn",
      "top" : "unet0_l4_conv2_exp_bn_output",
      "C" : 152,
      "blob_batchnorm_params" : 165,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l4_conv2_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l4_conv2_output_intermin_",
      "K" : 152,
      "name" : "unet0_l4_conv2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 152,
      "bottom" : "unet0_l4_conv2_exp_bn_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 167
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l4_conv2_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l4_conv2_output",
      "K" : 152,
      "blob_biases" : 169,
      "name" : "unet0_l4_conv2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 76,
      "bottom" : "unet0_l4_conv2_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 171
    },
    {
      "bottom" : "unet0_l3_down_output,unet0_l4_conv2_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "unet0_l4_residual",
      "top" : "unet0_l4_residual_output",
      "type" : "elementwise",
      "name" : "unet0_l4_residual",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "unet0_l4_down",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "unet0_l4_down_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "unet0_l4_down",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "unet0_l4_residual_output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "bottom" : "unet0_l4_down_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "unet0_l5_conv1_act",
      "top" : "unet0_l5_conv1_act_output",
      "type" : "activation",
      "name" : "unet0_l5_conv1_act"
    },
    {
      "name" : "unet0_l5_conv1_bn",
      "bottom" : "unet0_l5_conv1_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l5_conv1_bn",
      "top" : "unet0_l5_conv1_bn_output",
      "C" : 76,
      "blob_batchnorm_params" : 173,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l5_conv1_exp",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l5_conv1_exp_act_output",
      "K" : 76,
      "blob_biases" : 175,
      "name" : "unet0_l5_conv1_exp",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "unet0_l5_conv1_bn_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 177
    },
    {
      "name" : "unet0_l5_conv1_exp_bn",
      "bottom" : "unet0_l5_conv1_exp_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l5_conv1_exp_bn",
      "top" : "unet0_l5_conv1_exp_bn_output",
      "C" : 152,
      "blob_batchnorm_params" : 179,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l5_conv1_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l5_conv1_output_intermin_",
      "K" : 152,
      "name" : "unet0_l5_conv1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 152,
      "bottom" : "unet0_l5_conv1_exp_bn_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 181
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l5_conv1_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l5_conv2_act_output",
      "K" : 152,
      "blob_biases" : 183,
      "name" : "unet0_l5_conv1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 76,
      "bottom" : "unet0_l5_conv1_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 185
    },
    {
      "name" : "unet0_l5_conv2_bn",
      "bottom" : "unet0_l5_conv2_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l5_conv2_bn",
      "top" : "unet0_l5_conv2_bn_output",
      "C" : 76,
      "blob_batchnorm_params" : 187,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l5_conv2_exp",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l5_conv2_exp_act_output",
      "K" : 76,
      "blob_biases" : 189,
      "name" : "unet0_l5_conv2_exp",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "unet0_l5_conv2_bn_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 191
    },
    {
      "name" : "unet0_l5_conv2_exp_bn",
      "bottom" : "unet0_l5_conv2_exp_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l5_conv2_exp_bn",
      "top" : "unet0_l5_conv2_exp_bn_output",
      "C" : 152,
      "blob_batchnorm_params" : 193,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l5_conv2_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l5_conv2_output_intermin_",
      "K" : 152,
      "name" : "unet0_l5_conv2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 152,
      "bottom" : "unet0_l5_conv2_exp_bn_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 195
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l5_conv2_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l5_conv2_output",
      "K" : 152,
      "blob_biases" : 197,
      "name" : "unet0_l5_conv2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 76,
      "bottom" : "unet0_l5_conv2_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 199
    },
    {
      "bottom" : "unet0_l4_down_output,unet0_l5_conv2_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "unet0_l5_residual",
      "top" : "unet0_l5_residual_output",
      "type" : "elementwise",
      "name" : "unet0_l5_residual",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "unet0_l5_down",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "unet0_l5_down_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "unet0_l5_down",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "unet0_l5_residual_output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "bottom" : "unet0_l5_down_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "unet0_l6_conv1_act",
      "top" : "unet0_l6_conv1_act_output",
      "type" : "activation",
      "name" : "unet0_l6_conv1_act"
    },
    {
      "name" : "unet0_l6_conv1_bn",
      "bottom" : "unet0_l6_conv1_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l6_conv1_bn",
      "top" : "unet0_l6_conv1_bn_output",
      "C" : 76,
      "blob_batchnorm_params" : 201,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l6_conv1_exp",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l6_conv1_exp_act_output",
      "K" : 76,
      "blob_biases" : 203,
      "name" : "unet0_l6_conv1_exp",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "unet0_l6_conv1_bn_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 205
    },
    {
      "name" : "unet0_l6_conv1_exp_bn",
      "bottom" : "unet0_l6_conv1_exp_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l6_conv1_exp_bn",
      "top" : "unet0_l6_conv1_exp_bn_output",
      "C" : 152,
      "blob_batchnorm_params" : 207,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l6_conv1_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l6_conv1_output_intermin_",
      "K" : 152,
      "name" : "unet0_l6_conv1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 152,
      "bottom" : "unet0_l6_conv1_exp_bn_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 209
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l6_conv1_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l6_conv2_act_output",
      "K" : 152,
      "blob_biases" : 211,
      "name" : "unet0_l6_conv1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 76,
      "bottom" : "unet0_l6_conv1_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 213
    },
    {
      "name" : "unet0_l6_conv2_bn",
      "bottom" : "unet0_l6_conv2_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l6_conv2_bn",
      "top" : "unet0_l6_conv2_bn_output",
      "C" : 76,
      "blob_batchnorm_params" : 215,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l6_conv2_exp",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l6_conv2_exp_act_output",
      "K" : 76,
      "blob_biases" : 217,
      "name" : "unet0_l6_conv2_exp",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "unet0_l6_conv2_bn_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 219
    },
    {
      "name" : "unet0_l6_conv2_exp_bn",
      "bottom" : "unet0_l6_conv2_exp_act_output",
      "weights" : {

      },
      "debug_info" : "unet0_l6_conv2_exp_bn",
      "top" : "unet0_l6_conv2_exp_bn_output",
      "C" : 152,
      "blob_batchnorm_params" : 221,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l6_conv2_step_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l6_conv2_output_intermin_",
      "K" : 152,
      "name" : "unet0_l6_conv2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 152,
      "bottom" : "unet0_l6_conv2_exp_bn_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 223
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "unet0_l6_conv2_step_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "unet0_l6_conv2_output",
      "K" : 152,
      "blob_biases" : 225,
      "name" : "unet0_l6_conv2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 76,
      "bottom" : "unet0_l6_conv2_output_intermin_",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 227
    },
    {
      "bottom" : "unet0_l5_down_output,unet0_l6_conv2_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "unet0_l6_residual",
      "top" : "unet0_l6_residual_output",
      "type" : "elementwise",
      "name" : "unet0_l6_residual",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "unet0_l6_down",
      "pad_fill_mode" : 0,
